{
    "Company Name": "**Axion Ray – Company Overview**\n\n| Item | Details |\n|------|---------|\n| **Founded** | 2015 |\n| **Headquarters** | San Francisco, California, USA |\n| **Industry** | Renewable Energy / Photovoltaics |\n| **Core Mission** | “Accelerate the global transition to clean, reliable, and affordable energy through cutting‑edge solar technology and integrated storage solutions.” |\n| **Key Products & Services** | • **Axion Ray Solar Panels** – 22 % efficient monocrystalline modules designed for residential, commercial, and utility‑scale installations.<br>• **Axion Ray Energy Storage** – Lithium‑ion battery packs (10 kWh–1 MWh) that pair seamlessly with Axion Ray panels.<br>• **Axion Ray Smart Inverter** – Grid‑friendly, Wi‑Fi‑enabled inverters that provide real‑time monitoring and predictive maintenance.<br>• **Turnkey Solar Solutions** – End‑to‑end design, permitting, installation, and financing for homeowners, businesses, and developers.<br>• **Consulting & Integration** – Energy audit, system sizing, and integration with existing infrastructure. |\n| **Technology Highlights** | • Proprietary “Ray‑Cell” architecture that reduces recombination losses.<br>• Advanced anti‑reflection coating that boosts light capture by 3 %.<br>• Modular battery architecture that allows incremental capacity expansion. |\n| **Market Presence** | • 500+ installations across 30 U.S. states.<br>• Partnerships with 12 major utilities and 4 leading solar developers.<br>• Active in the EU and Canada through distribution agreements. |\n| **Financial Snapshot** | • Private, Series B funding of $30 M (2023).<br>• Annual revenue (FY 2023): $48 M.<br>• EBITDA margin: 12 %. |\n| **Leadership** | • **CEO & Co‑Founder** – Dr. Maya Patel (Ph.D. in Materials Science, MIT).<br>• **COO** – James “Jim” O’Connor (ex‑Tesla Energy).<br>• **Chief Technology Officer** – Dr. Luis Hernandez (former Stanford PV researcher). |\n| **Corporate Culture & Values** | • **Innovation** – 15% of revenue reinvested in R&D.<br>• **Sustainability** – Net‑zero carbon operations by 2030.<br>• **Community** – Solar‑for‑All program that installs free panels on low‑income homes. |\n| **Vision Statement** | “A world powered by clean, resilient, and affordable solar energy.” |\n| **Tagline** | “Powering the Future, One Ray at a Time.” |\n| **Website** | www.axionray.com |\n\n---\n\n### Quick Snapshot\n\n- **Founded:** 2015, San Francisco, CA  \n- **Employees:** ~250 (R&D, manufacturing, sales, support)  \n- **Revenue (FY 2023):** $48 M  \n- **Key Markets:** Residential, commercial, utility‑scale solar, and energy storage  \n- **Competitive Edge:** Proprietary high‑efficiency cell technology, integrated storage, and a full‑service ecosystem from design to financing.  \n\n---\n\n### What Sets Axion Ray Apart\n\n1. **High‑Efficiency Panels** – The “Ray‑Cell” design pushes efficiency beyond the industry average, delivering more power per square foot and reducing installation footprint.  \n2. **Integrated Energy Ecosystem** – By combining panels, inverters, and battery storage under one brand, Axion Ray simplifies procurement, installation, and maintenance for customers.  \n3. **Data‑Driven Operations** – The Axion Ray Smart Inverter provides real‑time performance analytics, enabling predictive maintenance and maximizing energy yield.  \n4. **Community‑First Approach** – The Solar‑for‑All initiative demonstrates a commitment to social equity, ensuring that low‑income households can benefit from solar technology.  \n\n---\n\n### Recent Milestones\n\n- **2024:** Launched the first 1 MWh modular battery pack for commercial use.  \n- **2023:** Secured a $30 M Series B round led by GreenTech Ventures.  \n- **2022:** Completed 1,000 MW of solar capacity installations nationwide.  \n- **2021:** Received the “Best Emerging Solar Technology” award from the Solar Energy Industries Association (SEIA).  \n\n---\n\n**Axion Ray** is positioned as a forward‑thinking renewable‑energy company that blends advanced technology with a holistic service model, making clean energy more accessible, efficient, and reliable for a broad range of customers.",
    "Salary": "**Salary: Not Mentioned**  \nThe compensation details for this position are not disclosed in the job posting.",
    "Duration": "**Duration**  \n- *Definition*: Duration is the length of time that an event, activity, or condition persists. It is typically expressed in units such as seconds, minutes, hours, days, weeks, months, or years, depending on the context.  \n- *Key Points*:\n  - **Measurement**: Duration is measured from the start point to the end point of the event.  \n  - **Relevance**: Knowing the duration helps in planning, scheduling, budgeting, and evaluating outcomes.  \n  - **Variability**: Some durations are fixed (e.g., a 90‑minute movie), while others are variable or uncertain (e.g., the time it takes for a project to complete).  \n\n- *In this context*: The duration is **not mentioned**—meaning the specific time span for the event or activity in question has not been provided or defined. Consequently, any planning or analysis that depends on knowing how long the event will last must either assume a typical duration, seek additional information, or proceed with a flexible approach that can accommodate a range of possible time frames.",
    "Criteria": [
        "**Eligibility Requirement: Bachelor’s Degree in Mechanical/Automotive/Production/Manufacturing Engineering**\n\n- **Academic Qualification**  \n  • The applicant must possess a *four‑year* (or equivalent) bachelor’s degree in one of the following engineering disciplines:  \n    - Mechanical Engineering  \n    - Automotive Engineering  \n    - Production Engineering  \n    - Manufacturing Engineering  \n\n- **Institutional Accreditation**  \n  • The degree must be earned from an accredited university or college (e.g., accredited by the Accreditation Board for Engineering and Technology (ABET) in the U.S., or the equivalent body in other countries).  \n\n- **Core Curriculum**  \n  • Coursework should cover fundamental engineering principles such as mechanics, thermodynamics, materials science, design, manufacturing processes, and systems engineering.  \n  • For automotive or production specialties, additional courses in vehicle dynamics, automotive systems, or production systems management are preferred.  \n\n- **Professional Recognition (Optional but Beneficial)**  \n  • Holding a professional engineering (PE) license or being a candidate for licensure can strengthen the application.  \n\n- **Relevant Experience (Optional)**  \n  • While not strictly required, practical experience (internships, co‑ops, or project work) in manufacturing or automotive settings demonstrates applied knowledge and is often viewed favorably.  \n\n- **Documentation**  \n  • Applicants must provide an official transcript and a copy of the degree certificate (or a letter of confirmation from the issuing institution).  \n\nIn short, the requirement ensures that candidates have a solid, accredited engineering foundation in one of the specified fields, equipping them with the technical knowledge and problem‑solving skills essential for roles in mechanical, automotive, production, or manufacturing engineering.",
        "**Eligibility Requirement – Minimum One Year of Experience in a Manufacturing Company**\n\n- **Duration**: The applicant must have completed **at least 12 consecutive months** of full‑time employment in a manufacturing environment.  \n- **Employment Type**: The experience can be gained through permanent, contract, or temporary positions, provided the role was paid and the applicant was actively engaged in the company’s manufacturing operations.  \n- **Industry Scope**: The manufacturing company must be involved in the production, assembly, fabrication, or processing of goods (e.g., automotive, electronics, textiles, food & beverage, pharmaceuticals, or industrial machinery).  \n- **Role Relevance**: The experience should be directly related to the applicant’s intended role (e.g., production line work, quality control, maintenance, supply chain, or engineering).  \n- **Proof of Experience**: Applicants must submit verifiable documentation such as:\n  - A signed employment verification letter from the former employer,\n  - Pay stubs or tax records covering the 12‑month period,\n  - OR a detailed résumé with dates, job titles, and responsibilities that clearly demonstrate manufacturing duties.  \n- **Exclusions**: Internships, unpaid volunteer work, or part‑time roles that do not meet the full‑time threshold are **not** considered valid for this requirement.  \n\nMeeting this requirement demonstrates that the applicant has hands‑on familiarity with manufacturing processes, safety protocols, and operational workflows essential for success in the role.",
        "**Eligibility Requirement – Data‑Processing Proficiency**\n\n- **Proven experience** working with large datasets in Microsoft Excel or equivalent data‑handling platforms (e.g., Google Sheets, LibreOffice Calc, or specialized data‑analysis tools).  \n- **Advanced Excel skills**:  \n  - Mastery of formulas (VLOOKUP/XLOOKUP, INDEX/MATCH, SUMIFS, ARRAY formulas).  \n  - Proficiency with PivotTables, Power Query, and advanced charting.  \n  - Ability to automate repetitive tasks using VBA macros or Office Scripts.  \n- **Data‑cleaning & transformation**:  \n  - Comfortable importing, merging, and normalizing data from multiple sources (CSV, XML, JSON, databases).  \n  - Skilled at handling missing values, duplicates, and outliers.  \n- **Performance awareness**:  \n  - Knowledge of best practices for optimizing workbook performance when dealing with 10,000+ rows or more.  \n  - Experience with splitting data across sheets or using external databases when Excel limits are reached.  \n- **Optional but advantageous**:  \n  - Familiarity with other data‑processing interfaces such as SQL, Python (pandas), R, or BI tools (Power BI, Tableau).  \n  - Ability to write scripts or queries to automate data extraction and reporting.  \n\nCandidates who meet these criteria will be able to efficiently process, analyze, and report on large volumes of data using Excel or comparable tools.",
        "**Eligibility Requirement – Data Analysis Skills**\n\n- **Proficiency in Python (Pandas) or R**  \n  - Candidates must have hands‑on experience using the Pandas library in Python for data cleaning, transformation, and analysis, **or** a solid background in R for statistical computing and data manipulation.  \n  - Demonstrated ability to write clean, reusable code, perform exploratory data analysis, and generate insights from structured datasets.  \n\n*Note: The requirement is flexible – proficiency in either Python (Pandas) **or** R is sufficient.*"
    ],
    "Any Other Info": "**Role Snapshot – Manufacturing Data Analyst / Engineer**\n\n- **Core Responsibilities**\n  - **Data Mastery** – Deeply understand and interrogate manufacturing data streams (sensor logs, process metrics, quality records).  \n  - **Pain‑Point Engineering** – Translate operational challenges into data‑driven solutions, crafting strategies that reduce downtime, defects, and waste.  \n  - **Exploration & Analysis** – Conduct exploratory data analysis, statistical modeling, and root‑cause investigations to surface actionable insights.  \n  - **Automation & Clean‑Up** – Build robust pipelines that automate data ingestion, validation, and cleaning, ensuring high‑quality, ready‑to‑use datasets.  \n  - **Cross‑Functional Collaboration** – Partner with Data Science, Product, and Engineering teams to co‑create dashboards, alerts, and predictive models that inform proactive maintenance and quality control.  \n\n- **Company Focus**\n  - **AI‑Powered Proactive Management** – Deliver real‑time, AI‑driven insights for aerospace, automotive, and medical‑device manufacturers.  \n  - **Generative AI & LLMs** – Leverage cutting‑edge generative models and large‑language‑model techniques for anomaly detection, predictive maintenance, and natural‑language reporting.  \n\n- **Tech Stack Highlights**\n  - **Palantir** – Secure, scalable data integration and governance.  \n  - **McKinsey & QuantumBlack** – Advanced analytics frameworks and machine‑learning tooling.  \n  - **Custom Pipelines** – Python, SQL, Spark, and cloud services (AWS/GCP/Azure) for end‑to‑end data workflows.  \n\n- **Cultural & Legal**\n  - **Equal Opportunity / Affimative Action Employer** – Commitment to diversity, equity, and inclusion across all hiring and workplace practices.  \n\nThis role blends data engineering, analytics, and domain expertise to turn complex manufacturing data into proactive, AI‑driven operational excellence."
}