{
  "header": "The résumé belongs to Shubam Sarawagi, whose professional title is not indicated in the provided excerpt.",
  "contact": "The candidate can be contacted by phone at +91 916 361 5663 or via email at sarawagishubam@gmail.com. They are based in Kolkata, West Bengal.",
  "summary": "The summary section currently contains no content, so no details about roles, responsibilities, or achievements can be extracted.",
  "education": "Graduated from the SRM Institute of Science & Technology in Chennai, Tamil Nadu in May 2023 with a B‑Tech in Mechanical Engineering, complemented by a minor in Manufacturing Systems. The program emphasized core mechanical engineering principles while integrating advanced manufacturing techniques, culminating in a GPA of 9.1 out of 10.",
  "experience": "",
  "projects": "From January 2023 to May 2023, over a span of roughly five months, the candidate engineered a comprehensive data‑quality automation system for a manufacturing client, employing Python, Pandas, Excel, and SQL to cleanse and preprocess more than one hundred thousand rows of quality‑inspection data. The solution automated anomaly detection in production batches, cutting manual inspection time by nearly half, and surfaced recurring defect insights that lifted assembly‑line efficiency by a modest amount. In a separate engagement from August 2022 to December 2022—again about five months—the candidate performed an in‑depth analysis of more than fifty thousand automotive test records using R, Python, Excel, and Power BI, uncovering correlations between design parameters and failures. The resulting dashboards delivered key performance indicators such as yield rate, downtime, and defect frequency to stakeholders, and the candidate’s process‑improvement recommendations lowered defect rates by a modest amount. Earlier, from January 2022 to April 2022—approximately four months—the candidate modeled interrelationships among machines, processes, and outputs using production log data, and then automated Excel‑based summaries to streamline daily production‑meeting reporting workflows. Across all projects, the candidate demonstrated strong skills in data cleaning, preprocessing, anomaly detection, dashboard design, process optimization, and workflow automation.",
  "skills": "The candidate’s technical toolkit is built around core data‑science languages, including Python, R, and SQL, complemented by a strong command of analytical tools such as Excel, MySQL, and Power BI. They have applied these skills across a range of industrial domains—manufacturing knowledge, production systems, automotive engineering, and process optimization—while consistently engaging in data cleaning, exploration, and the extraction of business value. Their proficiency extends to popular scientific libraries, notably Pandas, NumPy, and Matplotlib, enabling robust data manipulation and visualization. Beyond technical expertise, the candidate demonstrates key soft skills in problem solving, communication, and teamwork, ensuring they can translate complex analytical insights into actionable business decisions.",
  "awards": "The candidate has earned a diverse set of certifications that underscore a strong foundation in both process improvement and data‑driven analytics. They hold a Six Sigma Green Belt in Manufacturing from Six Sigma, a credential that signals expertise in systematic quality and efficiency initiatives. Their proficiency in statistical programming is evidenced by a completion of the “R for Data Science” course from Datacamp, while an advanced understanding of spreadsheet‑based analytics is reflected in the “Advanced Excel for Business Analytics” certification from an unspecified provider. The candidate’s cloud‑machine‑learning acumen is highlighted by the AWS Academy Machine Learning Foundations award from AWS Academy, and their data‑analysis skills are further validated by the “Python for Data Analysis” course completed through Coursera. Together, these achievements demonstrate a well‑rounded skill set spanning manufacturing excellence, statistical analysis, business intelligence, cloud‑based machine learning, and Python‑driven data science.",
  "volunteering": "During her volunteer career, she served as a Safety Patrol member at La Martinière Calcutta, where she coordinated drills and safety procedures alongside a forty‑member team, ensuring full compliance during school events. She also volunteered with Bhumi India, organizing learning and activity sessions for more than two hundred children and playing a key role in fostering community engagement. These experiences highlight her strong coordination, event‑management, and community‑building skills."
}